nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/can/processor/can_p32mk1024gpe064.h
PLIB_INLINE_API bool PLIB_CAN_ExistsLatestFilterMatchGet(CAN_MODULE_ID index)
{
     return CAN_ExistsLatestFilterMatchGet_pic32(index);
}

PLIB_INLINE_API void PLIB_CAN_FilterToChannelLink(CAN_MODULE_ID index, CAN_FILTER filter, CAN_FILTER_MASK mask, CAN_CHANNEL channel)
{
     CAN_FilterToChannelLink_pic32(index, filter, mask, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsFilterToChannelLink(CAN_MODULE_ID index)
{
     return CAN_ExistsFilterToChannelLink_pic32(index);
}

PLIB_INLINE_API int PLIB_CAN_ReceiveErrorCountGet(CAN_MODULE_ID index)
{
     return CAN_ReceiveErrorCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsReceiveErrorCount(CAN_MODULE_ID index)
{
     return CAN_ExistsReceiveErrorCount_Default(index);
}

PLIB_INLINE_API int PLIB_CAN_TransmitErrorCountGet(CAN_MODULE_ID index)
{
     return CAN_TransmitErrorCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTransmitErrorCountGet(CAN_MODULE_ID index)
{
     return CAN_ExistsTransmitErrorCountGet_Default(index);
}

PLIB_INLINE_API CAN_ERROR_STATE PLIB_CAN_ErrorStateGet(CAN_MODULE_ID index)
{
     return CAN_ErrorStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsErrorState(CAN_MODULE_ID index)
{
     return CAN_ExistsErrorState_Default(index);
}

PLIB_INLINE_API char PLIB_CAN_TotalChannelsGet(CAN_MODULE_ID index)
{
     return CAN_TotalChannelsGet_Default(index);
}

PLIB_INLINE_API char PLIB_CAN_TotalFiltersGet(CAN_MODULE_ID index)
{
     return CAN_TotalFiltersGet_Default(index);
}

PLIB_INLINE_API char PLIB_CAN_TotalMasksGet(CAN_MODULE_ID index)
{
     return CAN_TotalMasksGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsModuleInfo(CAN_MODULE_ID index)
{
     return CAN_ExistsModuleInfo_Default(index);
}

#endif
